module.exports = {
  // ==========
  //  大   货
  // ==========
  '2': {
    '2000': {
      'name': '待确认',
      'detail': '创建订单成功',
      'title': '买家已下单，请及时确认订单价格',
      'notice': ['请及时确认订单花型数量与单价，订单确认前买家不能付款'],
      'button': [{
          'name': '确认订单',
          'methods': 'handleConfirmOrder'
        },
        {
          'name': '修改价格',
          'type': 'plain',
          'methods': 'handleEditPrice'
        },
        {
          'name': '关闭订单',
          'type': 'plain',
          'methods': 'handleCloseOrder'
        }
      ]
    },
    '201010': {
      'name': '付全款',
      'detail': '卖家确认订单',
      'title': '订单已确认，等待买家支付全款',
      'notice': ['您已与买家确认好价格，请尽快与通知买家进行支付。'],
      'button': [{
        'name': '修改价格',
        'type': 'plain',
        'methods': 'handleEditPrice'
      }]
    },
    '201020': {
      'name': '付定金',
      'detail': '卖家确认订单',
      'title': '订单已确认，等待买家支付订金',
      'notice': ['您设置的订单付款方式为分期支付，当前等待买家支付订金'],
      'button': [{
        'name': '修改价格',
        'type': 'plain',
        'methods': 'handleEditPrice'
      }]
    },
    '201030': {
      'name': '尾款确认',
      'detail': '买家已付定金',
      'title': '买家已付订金，请确认尾款金额',
      'notice': ['您设置的订单付款方式为分期支付，请确认尾款金额'],
      'button': [{
        'name': '确认尾款',
        'type': 'plain',
        'methods': 'handleEditPrice'
      }]
    },
    '201040': {
      'name': '付尾款',
      'detail': '卖家已修改尾款',
      'title': '买家已付订金，请确认尾款金额',
      'notice': ['您设置的订单付款方式为分期支付，请确认尾款金额'],
      'button': [{
        'name': '修改尾款',
        'type': 'plain',
        'methods': 'handleConfirmRetainage'
      }]
    },
    '2020': {
      'name': '待发货',
      'title': '买家已付款，请尽快发货',
      'detail': '买家已支付尾款',
      'notice': [],
      'button': [{
        'name': '发货',
        'type': 'plain',
        'methods': 'handleSend'
      }]
    },
    '2030': {
      'name': '待收货',
      'detail': '订单已出库',
      'title': '商家已发货，等待买家确认收货',
      'notice': ['等待买家确认收货，如买家逾期未确认收货，平系统将自动确认收货']
    },
    '2050': {
      'name': '验货',
      'title': '买家已确认收货，等待买家验货',
      'notice': ['商品已送达买家目的地，请耐心等待买家验货', '买家逾期未验货，系统将会自动确认验货成功', '验货期内，买家有权申请售后']
    },
    '2060': {
      'name': '交易完成',
      'title': '恭喜您，交易已成功',
      'notice': ['恭喜您，成功完成一笔交易。', '多多加油，争取完成更多交易。']
    },
    '9900': {
      'name': '已关闭',
      'title': '已关闭',
      'notice': ['取消类型：系统自动取消订单', '取消原因：买家逾期未支付订金。']
    },
    '9000': {
      'name': '售后中',
      'title': '售后中',
      'notice': ['买家申请售后，请耐心等待平台处理（买家反馈：货不对版）']
    }
  },
  // ==========
  //  剪   样
  // ==========
  '1': {
    '1010': {
      'name': '待寄样',
      'title': '买家已申请剪样，等待商家寄样',
      'detail': '创建订单成功',
      'notice': ['买家已申请寄样，请您尽快寄样，否则会影响后期的大货生意'],
      'button': [{
          'name': '确认寄样',
          'methods': 'handleNextOper'
        },
        {
          'name': '关闭订单',
          'type': 'plain',
          'methods': 'handleCancelOrder'
        }
      ]
    },
    '1020': {
      'name': '已寄样',
      'title': '已寄样，等待买家收样',
      'detail': '创建订单成功',
      'notice': ['买家已申请寄样，请您尽快寄样，否则会影响后期的大货生意'],
      'button': []
    },
    '1030': {
      'name': '已完成',
      'title': '买家已收样，交易完成',
      'notice': ['买家收样，您可以联系买家对于样本的满意度'],
      'button': []
    },
    '9900': {
      'name': '系统取消',
      'title': '已取消',
      'notice': ['取消类型：系统取消订单'],
      'button': []
    },
    '9910': {
      'name': '买家取消',
      'title': '已取消',
      'notice': ['取消类型：买家取消订单'],
      'button': []
    },
    '9920': {
      'name': '卖家取消',
      'title': '已取消',
      'notice': ['取消类型：卖家取消订单'],
      'button': []
    }
  },
  // ==========
  //  剪   版
  // ==========
  '3': {
    '3000': {
      'name': '待付款',
      'detail': '创建订单成功',
      'title': '订单已确认，等待买家支付',
      'notice': ['如买家不同意交易价格，您也可与买家协商后再修改价格'],
      'button': []
    },
    '3010': {
      'name': '待发版',
      'detail': '买家已付款',
      'title': '买家已付款，等待商家发版',
      'notice': ['买家已付款，请您尽快发版，否则买家有权进行退款'],
      'button': [{
        'name': '确认发版',
        'methods': 'handleNextOper'
      }]
    },
    '3020': {
      'name': '已发货/待收货',
      'detail': '订单已出库',
      'title': '买家已收样，交易完成',
      'notice': ['买家收样，您可以联系买家对于样本的满意度', '如果买家逾期未确认收版，系统将会自动确认收版。'],
      'button': []
    },
    '3030': {
      'name': '已完成',
      'detail': '买家已收样',
      'title': '恭喜您，交易已成功',
      'notice': ['恭喜您，又成功完成一笔交易。', '多多加油，争取完成大货交易，赶紧联系买家吧。', '如果您有什么建议，可联系客服人员。'],
      'button': []
    }
  }
};
