module.exports = {
  // 大货
  2: [
    {
      id: ['20'],
      name: '买家下单'
    }, {
      id: ['2000'],
      name: '确认订单'
    }, {
      id: ['2010', '201010', '201020', '201030', '201040'],
      name: '买家付款'
    }, {
      id: ['2020'],
      name: '发货'
    }, {
      id: ['2040'],
      name: '买家确认收货'
    }, {
      id: ['2050'],
      name: '买家验货'
    }, {
      id: ['2060'],
      name: '交易完成'
    }
  ],
  // 剪版
  3: [
    {
      id: ['10'],
      name: '买家下单'
    }, {
      id: ['2'],
      name: '确认订单'
    }, {
      id: ['3000'],
      name: '买家付款'
    }, {
      id: ['3010'],
      name: '发货'
    }, {
      id: ['3020'],
      name: '买家确认收货'
    }, {
      id: ['3030'],
      name: '交易完成'
    }
  ],
  // 剪样
  1: [
    {
      id: ['10'],
      name: '买家下单'
    }, {
      id: ['1010'],
      name: '寄样'
    }, {
      id: ['1020'],
      name: '买家收样'
    }, {
      id: ['1030'],
      name: '交易完成'
    }
  ]
};
